In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

## Cleaning Training Data

In [2]:
train = pd.read_excel('Data_Train.xlsx')

In [3]:
train.head()

,Name,Location,Year,Kilometers_Driven,Fuel_Type,Transmission,Owner_Type,Mileage,Engine,Power,Seats,Price
0,Maruti Wagon R LXI CNG,Mumbai,2010,72000,CNG,Manual,First,26.6 km/kg,998 CC,58.16 bhp,5.0,1.75
1,Hyundai Creta 1.6 CRDi SX Option,Pune,2015,41000,Diesel,Manual,First,19.67 kmpl,1582 CC,126.2 bhp,5.0,12.50
2,Honda Jazz V,Chennai,2011,46000,Petrol,Manual,First,18.2 kmpl,1199 CC,88.7 bhp,5.0,4.50
3,Maruti Ertiga VDI,Chennai,2012,87000,Diesel,Manual,First,20.77 kmpl,1248 CC,88.76 bhp,7.0,6.00
4,Audi A4 New 2.0 TDI Multitronic,Coimbatore,2013,40670,Diesel,Automatic,Second,15.2 kmpl,1968 CC,140.8 bhp,5.0,17.74

In [4]:
train.shape

(6019, 12)

In [5]:
train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6019 entries, 0 to 6018
Data columns (total 12 columns):
Name                 6019 non-null object
Location             6019 non-null object
Year                 6019 non-null int64
Kilometers_Driven    6019 non-null int64
Fuel_Type            6019 non-null object
Transmission         6019 non-null object
Owner_Type           6019 non-null object
Mileage              6017 non-null object
Engine               5983 non-null object
Power                5983 non-null object
Seats                5977 non-null float64
Price                6019 non-null float64
dtypes: float64(2), int64(2), object(8)
memory usage: 564.4+ KB

In [6]:
train.describe()

              Year  Kilometers_Driven        Seats        Price
count  6019.000000       6.019000e+03  5977.000000  6019.000000
mean   2013.358199       5.873838e+04     5.278735     9.479468
std       3.269742       9.126884e+04     0.808840    11.187917
min    1998.000000       1.710000e+02     0.000000     0.440000
25%    2011.000000       3.400000e+04     5.000000     3.500000
50%    2014.000000       5.300000e+04     5.000000     5.640000
75%    2016.000000       7.300000e+04     5.000000     9.950000
max    2019.000000       6.500000e+06    10.000000   160.000000

In [7]:
train.isnull().sum()

Name                  0
Location              0
Year                  0
Kilometers_Driven     0
Fuel_Type             0
Transmission          0
Owner_Type            0
Mileage               2
Engine               36
Power                36
Seats                42
Price                 0
dtype: int64

In [8]:
train.groupby('Seats')['Price'].nunique()

Seats
0.0        1
2.0       15
4.0       81
5.0     1161
6.0       30
7.0      390
8.0       97
9.0        3
10.0       4
Name: Price, dtype: int64

In [9]:
train.groupby('Mileage')['Price'].nunique()

Mileage
0.0 kmpl      59
10.0 kmpl     10
10.1 kmpl      7
10.13 kmpl     3
10.2 kmpl      6
              ..
9.52 kmpl      2
9.7 kmpl       1
9.74 kmpl      2
9.8 kmpl       4
9.9 kmpl       3
Name: Price, Length: 442, dtype: int64

####  There are "0.0" as values in the columns of mileage,power and engine so it can be considered as nan or empty value

In [10]:
train.groupby('Engine')['Price'].nunique()

Engine
1047 CC      4
1061 CC     23
1086 CC     69
1120 CC     37
1150 CC      7
          ...
970 CC       1
993 CC      12
995 CC       8
998 CC     117
999 CC      26
Name: Price, Length: 146, dtype: int64

#### From the above it is obvious that the mileage,seats,engine,power cannot be zero , so we can consider it as an empty data and will impute it with mean or mode.

#### we can see that the columns of mileage , engine and power are of string types so we first have to remove the string associated with it and convert it to float type.

In [11]:
def stringremover(doc):
    l = doc.split()
    for i in l:
        try:
            num = float(i)
            return num
        except:
            continue

#### Function to get only numeric value

In [12]:
mil_data = []
train['Mileage'] = train['Mileage'].fillna("0.0")
for i in range(len(train['Mileage'])):
    doc = train['Mileage'][i]
    res = stringremover(doc)
    mil_data.append(res)

In [13]:
train['Mileage'] = mil_data

In [14]:
train.head()

,Name,Location,Year,Kilometers_Driven,Fuel_Type,Transmission,Owner_Type,Mileage,Engine,Power,Seats,Price
0,Maruti Wagon R LXI CNG,Mumbai,2010,72000,CNG,Manual,First,26.60,998 CC,58.16 bhp,5.0,1.75
1,Hyundai Creta 1.6 CRDi SX Option,Pune,2015,41000,Diesel,Manual,First,19.67,1582 CC,126.2 bhp,5.0,12.50
2,Honda Jazz V,Chennai,2011,46000,Petrol,Manual,First,18.20,1199 CC,88.7 bhp,5.0,4.50
3,Maruti Ertiga VDI,Chennai,2012,87000,Diesel,Manual,First,20.77,1248 CC,88.76 bhp,7.0,6.00
4,Audi A4 New 2.0 TDI Multitronic,Coimbatore,2013,40670,Diesel,Automatic,Second,15.20,1968 CC,140.8 bhp,5.0,17.74

In [15]:
eng_data = []
train['Engine'] = train['Engine'].fillna("0.0")
for i in range(len(train['Engine'])):
    doc = train['Engine'][i]
    res = stringremover(doc)
    eng_data.append(res)

In [16]:
train['Engine'] = eng_data

In [17]:
train.head()

,Name,Location,Year,Kilometers_Driven,Fuel_Type,Transmission,Owner_Type,Mileage,Engine,Power,Seats,Price
0,Maruti Wagon R LXI CNG,Mumbai,2010,72000,CNG,Manual,First,26.60,998.0,58.16 bhp,5.0,1.75
1,Hyundai Creta 1.6 CRDi SX Option,Pune,2015,41000,Diesel,Manual,First,19.67,1582.0,126.2 bhp,5.0,12.50
2,Honda Jazz V,Chennai,2011,46000,Petrol,Manual,First,18.20,1199.0,88.7 bhp,5.0,4.50
3,Maruti Ertiga VDI,Chennai,2012,87000,Diesel,Manual,First,20.77,1248.0,88.76 bhp,7.0,6.00
4,Audi A4 New 2.0 TDI Multitronic,Coimbatore,2013,40670,Diesel,Automatic,Second,15.20,1968.0,140.8 bhp,5.0,17.74

In [18]:
pow_data = []
train['Power'] = train['Power'].fillna("0.0")
for i in range(len(train['Power'])):
    doc = train['Power'][i]
    res = stringremover(doc)
    pow_data.append(res)

In [19]:
train['Power'] = pow_data

In [20]:
train.head()

,Name,Location,Year,Kilometers_Driven,Fuel_Type,Transmission,Owner_Type,Mileage,Engine,Power,Seats,Price
0,Maruti Wagon R LXI CNG,Mumbai,2010,72000,CNG,Manual,First,26.60,998.0,58.16,5.0,1.75
1,Hyundai Creta 1.6 CRDi SX Option,Pune,2015,41000,Diesel,Manual,First,19.67,1582.0,126.20,5.0,12.50
2,Honda Jazz V,Chennai,2011,46000,Petrol,Manual,First,18.20,1199.0,88.70,5.0,4.50
3,Maruti Ertiga VDI,Chennai,2012,87000,Diesel,Manual,First,20.77,1248.0,88.76,7.0,6.00
4,Audi A4 New 2.0 TDI Multitronic,Coimbatore,2013,40670,Diesel,Automatic,Second,15.20,1968.0,140.80,5.0,17.74

In [21]:
train['Mileage'].replace(0.0,np.nan,inplace=True)
np.mean(train['Mileage'])

18.342252479408355

#### So we can take the mean of mileage as 18.00

In [22]:
train['Mileage'].fillna(value=18.00,inplace=True)

In [23]:
train['Engine'].replace(0.0,np.nan,inplace=True)
np.mean(train['Engine'])

1621.276449941501

#### So we can take the mean of engine as 1162.0

In [24]:
train['Engine'].fillna(value=1162.0,inplace=True)

In [25]:
np.mean(train['Power'])

112.56341677943078

#### So we can take the mean of power as 113.00

In [26]:
train['Power'].fillna(value=113.0,inplace=True)

In [27]:
train['Seats'].replace(0.0,np.nan,inplace=True)
np.mean(train['Seats'])

5.2796184738955825

#### so we can take the mean of seats as 5.0

In [28]:
train['Seats'].fillna(value=5.0,inplace=True)

In [29]:
train.isna().sum()

Name                 0
Location             0
Year                 0
Kilometers_Driven    0
Fuel_Type            0
Transmission         0
Owner_Type           0
Mileage              0
Engine               0
Power                0
Seats                0
Price                0
dtype: int64

#### So we have succesfully imputed all the empty values and got the numeric values from the columns of mileage, power and engine

## Cleaning testing data

In [30]:
test = pd.read_excel('Data_Test.xlsx')

In [31]:
test.head()

,Name,Location,Year,Kilometers_Driven,Fuel_Type,Transmission,Owner_Type,Mileage,Engine,Power,Seats
0,Maruti Alto K10 LXI CNG,Delhi,2014,40929,CNG,Manual,First,32.26 km/kg,998 CC,58.2 bhp,4.0
1,Maruti Alto 800 2016-2019 LXI,Coimbatore,2013,54493,Petrol,Manual,Second,24.7 kmpl,796 CC,47.3 bhp,5.0
2,Toyota Innova Crysta Touring Sport 2.4 MT,Mumbai,2017,34000,Diesel,Manual,First,13.68 kmpl,2393 CC,147.8 bhp,7.0
3,Toyota Etios Liva GD,Hyderabad,2012,139000,Diesel,Manual,First,23.59 kmpl,1364 CC,null bhp,5.0
4,Hyundai i20 Magna,Mumbai,2014,29000,Petrol,Manual,First,18.5 kmpl,1197 CC,82.85 bhp,5.0

In [32]:
test.isna().sum()

Name                  0
Location              0
Year                  0
Kilometers_Driven     0
Fuel_Type             0
Transmission          0
Owner_Type            0
Mileage               0
Engine               10
Power                10
Seats                11
dtype: int64

In [33]:
mil_test_data = []
for i in range(len(test['Mileage'])):
    doc = test['Mileage'][i]
    res = stringremover(doc)
    mil_test_data.append(res)

In [34]:
test['Mileage'] = mil_test_data

In [35]:
eng_test_data = []
test['Engine'] = test['Engine'].fillna("0.0")
for i in range(len(test['Engine'])):
    doc = test['Engine'][i]
    res = stringremover(doc)
    eng_test_data.append(res)

In [36]:
test['Engine'] = eng_test_data

In [37]:
pow_test_data = []
test['Power'] = test['Power'].fillna("0.0")
for i in range(len(test['Power'])):
    doc = test['Power'][i]
    res = stringremover(doc)
    pow_test_data.append(res)

In [38]:
test['Power'] = pow_test_data

In [39]:
test.head()

,Name,Location,Year,Kilometers_Driven,Fuel_Type,Transmission,Owner_Type,Mileage,Engine,Power,Seats
0,Maruti Alto K10 LXI CNG,Delhi,2014,40929,CNG,Manual,First,32.26,998.0,58.20,4.0
1,Maruti Alto 800 2016-2019 LXI,Coimbatore,2013,54493,Petrol,Manual,Second,24.70,796.0,47.30,5.0
2,Toyota Innova Crysta Touring Sport 2.4 MT,Mumbai,2017,34000,Diesel,Manual,First,13.68,2393.0,147.80,7.0
3,Toyota Etios Liva GD,Hyderabad,2012,139000,Diesel,Manual,First,23.59,1364.0,NaN,5.0
4,Hyundai i20 Magna,Mumbai,2014,29000,Petrol,Manual,First,18.50,1197.0,82.85,5.0

In [40]:
test['Mileage'].replace(0.0,np.nan,inplace=True)
np.mean(test['Mileage'])

18.367354627354615

In [41]:
test['Mileage'].fillna(value=18.00,inplace=True)

In [42]:
test['Engine'].replace(0.0,np.nan,inplace=True)
np.mean(test['Engine'])

1593.5849673202615

In [43]:
test['Engine'].fillna(value=1594.00,inplace=True)

In [44]:
test['Power'].replace(0.0,np.nan,inplace=True)
np.mean(test['Power'])

110.38042013311168

In [45]:
test['Power'].fillna(value=110.00,inplace=True)

In [46]:
test['Seats'].replace(0.0,np.nan,inplace=True)
np.mean(test['Seats'])

5.28454619787408

In [47]:
test['Seats'].fillna(value=5.00,inplace=True)

In [48]:
test.head()

,Name,Location,Year,Kilometers_Driven,Fuel_Type,Transmission,Owner_Type,Mileage,Engine,Power,Seats
0,Maruti Alto K10 LXI CNG,Delhi,2014,40929,CNG,Manual,First,32.26,998.0,58.20,4.0
1,Maruti Alto 800 2016-2019 LXI,Coimbatore,2013,54493,Petrol,Manual,Second,24.70,796.0,47.30,5.0
2,Toyota Innova Crysta Touring Sport 2.4 MT,Mumbai,2017,34000,Diesel,Manual,First,13.68,2393.0,147.80,7.0
3,Toyota Etios Liva GD,Hyderabad,2012,139000,Diesel,Manual,First,23.59,1364.0,110.00,5.0
4,Hyundai i20 Magna,Mumbai,2014,29000,Petrol,Manual,First,18.50,1197.0,82.85,5.0

In [49]:
test.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1234 entries, 0 to 1233
Data columns (total 11 columns):
Name                 1234 non-null object
Location             1234 non-null object
Year                 1234 non-null int64
Kilometers_Driven    1234 non-null int64
Fuel_Type            1234 non-null object
Transmission         1234 non-null object
Owner_Type           1234 non-null object
Mileage              1234 non-null float64
Engine               1234 non-null float64
Power                1234 non-null float64
Seats                1234 non-null float64
dtypes: float64(4), int64(2), object(5)
memory usage: 106.2+ KB

In [50]:
test.isna().sum()

Name                 0
Location             0
Year                 0
Kilometers_Driven    0
Fuel_Type            0
Transmission         0
Owner_Type           0
Mileage              0
Engine               0
Power                0
Seats                0
dtype: int64